# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0 #p/2

    [-1, 1, InvertedResidual, [128, 1, 4]], #p/4
  
    [-1, 1, InvertedResidual, [128, 2, 2]], #p/4
    [-1, 1, InvertedResidual, [128, 1, 2]], #p/4

    [-1, 1, InvertedResidual, [128, 2, 4]], #p/8
    [-1, 1, MobileViTBlockv2, [128, 96, 1, 1, 0.0, 0.0, 0.0, 2, 2, 3, 1]], 
    
    [-1, 1, InvertedResidual, [256, 2, 4]], #p/16
    [-1, 1, MobileViTBlockv2, [256, 192, 1, 1, 0.0, 0.0, 0.0, 2, 2, 3, 1]],
    
    [-1, 1, InvertedResidual, [512, 2, 4]], #p/32
    [-1, 1, MobileViTBlockv2, [512, 384, 1, 1, 0.0, 0.0, 0.0, 2, 2, 3, 1]],

    [-1, 1, SPPF, [512, 5]], # 10
  ]

# YOLOv5 v6.0 head
head: [

    # [-1, 3, C3RFEM, [512]],
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 7], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 14

    # [-1, 3, C3RFEM, [256]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 18 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 15], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 21 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 11], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 24(P5/32-large)

    [[18, 21, 24], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
